Repository: MenwaLab/Enchanted--Forest
Catalog: Resources/Strings.*.resx
Languages: es

source: Play
es: Jugar

source: Change Language
es: Cambiar idioma

source: Exit
es: Salir

# StartingGame
source: Starting the game...
es: Iniciando el juego...

# ExitingGame
source: Exiting the game. Bye!
es: Saliendo del juego. ¡Hasta la próxima! -Meylí

# LanguageChanged
source: Language changed to
es: Idioma cambiado a

# ThankYou
source: Thank you for playing Enchanted Forests Maze. Hope you had fun! See you next time! -Meyli
es: ¡Gracias por jugar al Laberinto del Bosque Encantado. ¡Espero que se hayan divertido!. ¡Hasta la próxima!. -Meylí

# WelcomeMessage
source: Welcome to the game: Enchanted ForestÂ´s Maze! Once upon a time, there was a beautiful, magical, and safe forest in Sylvaria. But an evil dark entity has cursed this town, turning the forest into a dark and frightening maze filled with traps designed to harm you and prevent your escape.Your mission is to find the exit (a star shining brightly, waiting for you). However, be careful because on your path, you will not only encounter malicious traps but also need to compete with the other player. Even though both of you will start this adventure, only one will survive. Not all is doomed because the queen and king are inside the maze and will help whenever you visit them. Oh, I almost forgot! There's an area in this forest unlike the others; the curse has made it invisible. If you land on it, you will be teleported to a random location in the forest, so watch your step. Without further ado, good luck to you both, and let the games begin!
es: Bienvenido al juego: ¨Laberinto del Bosque Encantado¨. Había una vez un hermoso, mágico y pacífico bosque en Sylvaria pero una malvada entidad ha hechizado este poblado, convirtiéndolo en un oscuro y tenebroso laberinto con trampas dispuestas a dañarte y evitar tu escape. Por lo que la misión de ambos es encontrar la salida (una radiante estrella esperando por ustedes), pero tengan mucho cuidado porque en el camino no solo se enfretarán a trampas malévolas, sino también tendrán que competir entre ustedes. Aunque los dos comiencen esta aventura, solo uno sobrevivirá. Pero no todo está perdido, porque la Reina y el Rey estarán dentro del laberinto con ustedes y los ayudarán cada vez que los visiten. !Oh, casi olvidaba!. Hay una zona en este bosque diferente a las demás porque el hechizo la hizo invisible y si caen en ella serán transportados a un lugar aleatorio dentro del bosque, así que tengan cuidado. Sin más dilación, mucha suerte a ambos y que comience el juego!

# EnterMazeSize
source: Please enter the size of the maze you would like to play with (note that only numbers starting from 7 are allowed)
es: Por favor, ingrese el tamaño del laberinto con el que jugará (solo números mayores que 7 están permitidos)

# InvalidMazeSize
source: Please enter a valid size for the maze (minimum 7):
es: Por favor, inserta un tamaño válido para el laberinto (mínimo 7):

# AvailableTokens
source: These are the citizens trapped in the maze, each one has a distinct ability, speed(number of cells the token can move) and cooldown time (number of turns where the token cant use their ability):
es: A continuación se encuentran los personajes que están atrapados en el laberinto, y cada uno tiene una habilidad, velocidad (número de casillas que la ficha puede desplazarse) y tiempo de enfriamiento (cantidad de turnos que impide el uso de su habilidad):

# Player1ChooseToken
source: Player 1, please choose your token by entering its number:
es: Jugador 1, por favor, elija su ficha ingresando su número:

# InvalidTokenChoice
source: Please enter a valid token number(between 1 and 6):
es: Por favor, ingresa un número válido para tu ficha (entre 1 y 6):

# PlayerChoseToken
source: Player {0} chose {1}.
es: El jugador {0} eligió la ficha {1}.

# PlayerTurn
source: {0}, its your turn. Your position is {1}.
es: {0}, es tu turno. Tu posición es {1}.

# SkippingTurn
source: {0} is skipping a turn.
es: El jugador {0} no juega este turno.

# UseAbilityPrompt
source: Do you want to use your ability? (Insert 1 for Yes, 0 for No):
es: ¿Quieres usar tu habilidad? (Inserte 1 para Sí, 0 para No):

# InvalidInputYN
source: Invalid input. Please enter 1 for Yes or 0 for No:
es: Entrada inválida. Por favor ingresa 1 para Sí o 0 para No:

# CooldownReduced
source: {0} reduced cooldown by 2! Current cooldown: {1}
es: {0} está visitando al Rey y él le redujo su tiempo de enfriamient en 2! Tiempo de enfriamiento actual: {1}

# SpeedIncreased
source: {0} increased speed by 1!
es: {0} está visitando a la reina y ella le aumentó su velocidad en 1!

# VictoryMessage
source: {0} has reached the shininig star and escaped the maze! Congratulations you survived and won the game!
es: ¡El jugador {0} ha encontrado la salida del laberinto! !Ganaste el juego, felicidades!

# PlayAgain
source: Do you want to play again? (Insert 1 for Yes, 0 for No):
es: ¿Quieres jugar de nuevo? (Inserte 1 para Sí, 0 para No):

# InvalidInput
source: Invalid input. Please enter 1 for Yes or 0 for No:
es: Entrada inválida. Por favor, ingresa 1 para Sí o 0 para No:

# ArrowKeyPrompt
source: Press an arrow key to move:
es: Presiona una tecla de dirección para moverte:

# InvalidArrowKey
source: Please press a valid arrow key to move:
es: Por favor, presiona una tecla válida para moverte:

# InvalidMove
source: No valid moves in that direction. Please try again.
es: No hay movimientos válidos en esa dirección. Por favor, cambie de dirección.

# TrapAlreadyTriggered
source: Trap has already been triggered.
es: Trampa ya ha sido activada.

# TeleportRandom
source: {0} stepped on the random teleport portal! Teleporting to a random position...
es: ¡El jugador {0} cayó en el portal de teletransportación! Transportándolo a una posición aleatoria...

# Trap1Triggered
source: {0} has fallen into a trap! You will lose a turn trying to put out the fire.
es: !{0} ha caído en una trampa! Perderás un turno intentanto apagar el fuego.

# Trap2Triggered
source: {0} has fallen into a trap! This hole has sent you to the origin (0, 0).
es: !{0} ha caído en una trampa! Este hoyo te ha enviado al origen de coordenadas (0, 0).

# Trap3Triggered
source: {0} has fallen into a trap! You have been stung by a bee and youre in pain, so your speed has been reduced to {1}.
es: !{0} ha caído en una trampa! Te ha picado una abeja y estás adolorido por tanto tu velocidad ha sido reducida a {1}.

# Trap4Triggered
source: {0} has fallen into a trap! You've encountered the bat of the evil entity, it increases your cooldown time to {1}.
es: ! {0} ha caído en una trampa! Te has encontrado con el murciélago de la entidad malvada, él te aumenta tu tiempo de enfriamiento a {1}.

# PlayerSwappedPositions
source: {0} and {1} have swapped positions.
es: {0} y {1} han intercambiado posiciones.

# OutOfBoundsMessage
source: Position ({0}, {1}) is outside the maze bounds.
es: Posición ({0}, {1}) se encuentra fuera del laberinto.

# ElfMimicAbility
source: {0}'s Elf is mimicking {1}'s {2} ability.
es: La ficha Duende del jugador{0} está copiando la habilidad de la ficha {2} del jugador {1}.

# WizardReduceSpeed
source: {0}'s Wizard reduces {1}'s speed.
es: La ficha Mago del jugador {0} reduce la velocidad del jugador {1}.

# FairySwapPosition
source: {0}'s Fairy swaps position with {1}.
es: EL Hada del jugador {0} cambia de posición con el jugador {1}.

# SirenSkipTurn
source: {0}'s Siren skips {1}'s turn.
es: La Sirena del jugador {0} le quita el turno al jugador {1}.

# AbuelaIncreaseSpeed
source: {0}'s Abuela increases their speed by 1.
es: La ficha Abuela del jugador {0} aumenta su velocidad por 1.

# UnicornBlessing
source: {0}'s Unicorn increases its own speed by 1.
es: El Unicornio del jugador {0} aumenta su velocidad por 1.

# UnicornSwapPosition
source: {0}'s Unicorn swaps position with {1}.
es: El unicornio del jugador {0} cambia de posición con el jugador {1}.

# UnicornSkipTurn
source: {0}'s Unicorn skips {1}'s turn.
es: El Unicornio del jugador {0} le quita el turno al jugador {1}.

# UnicornIncreaseSpeed
source: {0}'s Unicorn increases its own speed by 1.
es: El Unicornio del jugador {0} aumenta su velocidad por 1.

# AbilityInCooldown
source: {0}, your ability is on cooldown.
es: {0}, tu habilidad está en enfriamiento.

# AbilityUsed
source: {0} used their ability. Cooldown reset to {1}.
es: {0} usó su habilidad. Tiempo de enfriamiento: {1}.

# ElfDescription
source: Permanently copies the ability of the other player's token
es: El Elfo🧝, guardián del bosque encantado, tiene la habilidad única de copiar permanentemente las habilidades de la ficha del otro jugador. Con sus agudos sentidos y agilidad inigualable, asegura el equilibrio dentro de los bosques místicos.

# WizardDescription
source: Reduces the speed of the other player's token
es: El Mago🧙, maestro de antiguos hechizos y conocimiento arcano, puede reducir la velocidad de la ficha del otro jugador. Su mera presencia invoca asombro y respeto mientras canaliza la magia pura del bosque para manipular el tiempo y el movimiento.

# FairyDescription
source: Swaps its position with the position of the other player's token
es: La Hada🧚, una criatura delicada pero poderosa, puede intercambiar su posición con la posición de la ficha del otro jugador. Con alas que brillan a la luz de la luna, ella danza por el aire, tejiendo encantamientos y travesuras.

# SirenDescription
source: Skips the other player's turn
es: La Sirena🧜, cuya melodía hipnótica puede hacer que el otro jugador pierda su turno, es una visión tanto de belleza como de peligro. Su voz resuena a través del laberinto, atrayendo a los incautos con promesas de seguridad, solo para atraparlos en su cautivadora canción.

# GrandmaDescription
source: She can increase her own speed by 1
es: La Abuela👵, la aventurera desprevenida, se adentró en el bosque encantado puramente por casualidad, atraída por la belleza de sus árboles y motivada por la idea de tomar la foto perfecta para sus nietos. Tiene la encantadora habilidad de aumentar su propia velocidad en 1.

# UnicornDescription
source: Activates a random effect as a combination of abilities of the previous tokens
es: El Unicornio🦄, un ser místico y majestuoso, activa un efecto aleatorio como una combinación de las habilidades de las fichas anteriores. Con su radiante cuerno y presencia etérea, aporta un toque de magia impredecible al bosque.
